#Типы данных в питоне

#1. NoneType - ничего,пустота ->None
# ctrl + / сделать коментарий
# 2.Boolean - истина и ложь -> True/False
# 3.String - строки - str "Hello world", 'hello world'
# "My name is anton"
# 'Im not King'
# 4.числовые типы данных
# a) integer - целое int 
# b) float - число с точкой 
# c) comples - комплексные числа (0j=1) не нужно
# 5.Списковые типы данных(коллекция)
# a)list(массив/список) ->[5,2,4,true,"hello"]
# b)tuple(кортеж) -> (1,2,3,None)
# c) rage(последовательнось) -> (1,10)
# 6. set() - множество ->{1,2,3,4,5,6,7,8}
#7. dict(словари) -> содержат в себе данные в виде ключа и значения {1:'one',2:'two'} 
# -------------------------------------------------------------
# mutable (изменяемые типы данных)
# 1. list
# 2. set
# 3. dict

# immutable (неизменяемые типы данных)
# 1.None
# 2.bool
# 3.int,float,copmplex
# 4.str
# 5.tuple, range
# 6. frozenset

# --------------------------------------------------------------------------
# переменная - проименованная область памяти предназначенная для хранения данных. с ее помощью мы можем проводить различные операции с данными
# num = 5
# strok = "Hello world"
# '''
# стандартный вывод данных - 3 точки = текст в несколько строк
# '''
# в питоне для вывода данных в терминал используется функция print()
# print(strok)
# print(27+5)
# '''
# стандартный ввод данных
# используется функция input()
# '''

# a=input("Введите число:")
# num=int(a)
# # print(num)
# # print(type(num))
# # print("Данные в переменных",a,num)
# print("В переменной а хранится:",a,"ее тип данных",type(a))
# print("В переменной num хранится:",num,"ее тип данных",type(num))

