"""
GIT - это распределенная система конторля версий
это система для отслеживания и ведения истории изменения файлов, в вашем проэкте при помощи 
распределенности GITa еще и организовывается командная работа
"""

"""
Репозиторий - это хранилище вашего кода и история его изменений
"""

"""
GitHub - веб сайт для размещения git-репозиториев в совместной разработке
"""

"""
Команды Git
1. git init - создает новый локальный репозиторий, в той директориий в которой была прописана команда.(Вводится 1 раз в начале)

2. git add - команда для добавления изменений в систему отслеживаний гита

3. git commit -m "<cooment>" - команда для созранения всех изменений в локальном репозитории с коментарием к ним

4. git remote add <origin> <url> - это команда для того чтобы связать ваш локальный репо с удаленным репо в гитхабе

5. git push <origin> <main> - команда отправки всех ваших изменений на удаленный репо 
"""
#-------------------------------------------
# 1)git init 
#     2)git add.
#     3)git commit -m ""
# 4)git remote add origin <url>
# 5)git push origin main